src/InformationRegisters/ТоварыВОборудовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ТоварыВОборудовании</Name>
			<Comment>Сведения о товарах которые выгружаются в оборудование</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Comment>Номер ячейки PLU</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения товара. Если момент больше чем "момент последней загрузки" оборудования, то этот товар надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВыполненаПечатьЦенников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГруппаТоваров</Name>
					<Comment>Группа товаров оборудования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыТоваровОборудования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрих-код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/УценкаТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УценкаТовара</Name>
			<Comment>Сведения о скидках назначаемых на каждую товарную строку документов</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСкидки</Name>
					<Comment>Значение скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Comment>Действует или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВычисления</Name>
					<Comment>Способ вычисления скидки (относительная/абсолютная)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СкидкиСпособВычисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения скидки. Если момент больше чем "момент последней загрузки" оборудования, то эту скидку надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантОкругления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОкругления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОформленВЦО</Name>
					<Comment>Оформлен в центральном офисе</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Товар, на который назначается скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалОбслуживания</Name>
					<Comment>Зал/Склад/Отдел в котором действует данная скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокДействия</Name>
					<Comment>Срок действия цен</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтруктураИерархииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтруктураИерархииНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
			<Comment>Основной признак номенклатурной позиции</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Comment>Вид номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Comment>Признак указывает, что товар является весовым. Используется для определения вида штрих-кодирования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<Comment>Способ использования характеристик</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеШтрихКодов</Name>
					<Comment>Использование штрихкодов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>Основная единица измерения, подставляемая по умолчанию для номенклатурных позиций данного типа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоСписаниеХарактеристик</Name>
					<Comment>Режим автоматического списания характеристик номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыАвтоСписанияХарактеристик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеДанныхХарактеристик</Name>
					<Comment>Ограничение данных характеристик</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОграниченияДанныхХарактеристики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальностьСерийногоНомера</Name>
					<Comment>Уникальность серийного номера</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойТипЭксплуатации</Name>
					<Comment>Основной тип эксплуатации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтучноВесовой</Name>
					<Comment>Признак штучно-весового товара. Используется для определения вида штрих-кодирования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетЦенТолькоВРазрезеДопПараметров</Name>
					<Comment>Задает ограничение на поиск цены для данного типа номенклатуры. Если Истина - то поиск цены будет осуществляться только в разрезе доп. параметров (характеристики, единицы измерения, подразделения)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствНоменклатуры</Name>
					<Comment>Набор свойств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствХарактеристик</Name>
					<Comment>Набор свойств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЦенника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПредметаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиПредметаРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеЕдиницИзмерения</Name>
					<Comment>Способ использования единиц измерения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименованийТоваров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьУчета</Name>
					<Comment>Особенность учета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобенностиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛокНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИностранное</Name>
					<Comment>Иностранное наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ТоварыВОборудовании/Ext/ManagerModule.bsl
// Модуль менеджера регистра сведений "Товары в оборудовании"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
Процедура НоменклатураПриИзменении(Номенклатура, ШтрихКод, ПараметрыДействия=Неопределено) Экспорт
	ШтрихКодыОбъекта = Новый ТаблицаЗначений;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ЭтоВесовой = (Номенклатура.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Весовой);
		ШтрихКодыОбъекта  = ШтрихкодированиеВызовСервера.ПолучитьШтрихКодОбъекта(Номенклатура,,, Истина);
		Если НЕ ШтрихКодыОбъекта.Количество() >0 Тогда
			Штрихкод = "";
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ШтрихКод) ИЛИ ШтрихКодыОбъекта.Найти(ШтрихКод) = Неопределено Тогда
			Для Каждого ТекущаяСтрока Из ШтрихКодыОбъекта Цикл
				Если ТекущаяСтрока.Запрет Тогда
					Продолжить;
				КонецЕсли;
					Штрихкод = ТекущаяСтрока.Штрихкод;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // СкидкиНоменклатураПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьНомерНовойЯчейки(ГруппаТоваров, ЗаполнятьПропуски = Неопределено) Экспорт
	
	НомерЯчейки = 1;
	
	Если ЗаполнятьПропуски = Неопределено Тогда
		ЗаполнятьПропуски = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаТоваров, "ЗаполнятьПропуски");
	КонецЕсли;
	
	Если ЗаполнятьПропуски Тогда
		СвободныеНомераЯчеек = ПолучитьСвободныеНомераЯчеек(ГруппаТоваров);
		Если СвободныеНомераЯчеек.Количество()>0 Тогда
			НомерЯчейки = СвободныеНомераЯчеек[0];
		КонецЕсли;
	Иначе
		НомерЯчейки = НомерЯчейки + ПолучитьМаксимальныйНомерЯчейки(ГруппаТоваров);
	КонецЕсли;
	
	Возврат НомерЯчейки;
	
КонецФункции

// Функция возвращает максимальный номер ячейки.
//
// Параметры:
//  ГруппаТоваров - СправочникСсылка - Группа товаров в которой выбирается номер максимальной ячейки.
//
Функция ПолучитьМаксимальныйНомерЯчейки(ГруппаТоваров) Экспорт
	
	НомерЯчейки = 0;
	
	// Формируем текст запроса
	ТекстЗапроса ="
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТоварыВОборудовании.НомерЯчейки) КАК НомерЯчейки
	|ИЗ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ГДЕ
	|	ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	// Устанавливаем параметр запроса
	Запрос.УстановитьПараметр("ГруппаТоваров", ГруппаТоваров);
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Перебираем полученную выборку для определения максимального номера ячейки
	Если Выборка.Следующий() Тогда
		
		НомерЯчейки = Выборка.НомерЯчейки;
		
		Если НЕ ЗначениеЗаполнено(НомерЯчейки) Тогда
			НомерЯчейки = 0;
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат НомерЯчейки;
	
КонецФункции // ПолучитьМаксимальныйНомерЯчейки()

Функция ПолучитьСвободныеНомераЯчеек(ГруппаТоваров) Экспорт
	
	Результат = Новый Массив;
	
	// Формируем текст запроса
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТоварыВОборудовании.НомерЯчейки КАК НомерЯчейки
	|ПОМЕСТИТЬ
	|	ТаблицаЯчеек
	|ИЗ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ГДЕ
	|	ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЯчеек.НомерЯчейки КАК НомерЯчейки,
	|	МИНИМУМ(ТаблицаПропусковНомеров.НомерЯчейки) КАК МаксимальныйНомерЯчейки
	|ИЗ
	|	ТаблицаЯчеек КАК ТаблицаЯчеек
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЯчеек КАК ТаблицаПропусковНомеров
	|ПО
	|	ТаблицаЯчеек.НомерЯчейки < ТаблицаПропусковНомеров.НомерЯчейки
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЯчеек.НомерЯчейки
	|ИМЕЮЩИЕ
	|	ТаблицаЯчеек.НомерЯчейки < (МИНИМУМ(ТаблицаПропусковНомеров.НомерЯчейки)-1)
	|;
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ТаблицаЯчеек.НомерЯчейки), 0) КАК НомерЯчейки
	|ИЗ
	|	ТаблицаЯчеек КАК ТаблицаЯчеек
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	// Устанавливаем параметр запроса
	Запрос.УстановитьПараметр("ГруппаТоваров", ГруппаТоваров);
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	
	ВыборкаПропусковНомеров   = ПакетыЗапросов[ПакетыЗапросов.Количество()-2].Выбрать();
	ВыборкаМаксимальнаяЯчейка = ПакетыЗапросов[ПакетыЗапросов.Количество()-1].Выбрать();
	
	Пока ВыборкаПропусковНомеров.Следующий() Цикл
		НомерЯчейки = ВыборкаПропусковНомеров.НомерЯчейки+1;
		Пока НомерЯчейки<ВыборкаПропусковНомеров.МаксимальныйНомерЯчейки Цикл
			Результат.Добавить(НомерЯчейки);
			НомерЯчейки = НомерЯчейки + 1;
		КонецЦикла;
	КонецЦикла;
	
	// Перебираем полученную выборку для определения максимального номера ячейки
	Если ВыборкаМаксимальнаяЯчейка.Следующий() Тогда
		Результат.Добавить(ВыборкаМаксимальнаяЯчейка.НомерЯчейки + 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеУценки(Номенклатура, ГруппаТоваров) Экспорт
	
	Если ТипЗнч(Номенклатура) = Тип("Массив") Тогда
		ОтборПоНоменклатуре = Номенклатура;
	Иначе
		ОтборПоНоменклатуре = Новый Массив;
		ОтборПоНоменклатуре.Добавить(Номенклатура);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании КАК ПодразделениеКомпании
	|ПОМЕСТИТЬ
	|	ГруппыТоваровОборудования
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования = &ГруппаТоваров
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УценкаТовара.Номенклатура КАК Номенклатура,
	|	УценкаТовара.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УценкаТовара КАК УценкаТовара
	|ПО
	|	ГруппыТоваровОборудования.ПодразделениеКомпании = УценкаТовара.ПодразделениеКомпании
	|ГДЕ
	|	УценкаТовара.Номенклатура В (&Номенклатура) И 
	|	УценкаТовара.Действует
	|";
	
	Запрос.УстановитьПараметр("Номенклатура",  ОтборПоНоменклатуре);
	Запрос.УстановитьПараметр("ГруппаТоваров", ГруппаТоваров);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция АвтоматическиЗаполнитьГруппыОборудования(СкладКомпании, Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования КАК ГруппаТоваров
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ПометкаУдаления = ЛОЖЬ И 
	|	ПодключаемоеОборудование.ОсновнойОтдел = (&СкладКомпании) И 
	|	(НЕ ПодключаемоеОборудование.ГруппаТоваровОборудования = ЗНАЧЕНИЕ(Справочник.ГруппыТоваровОборудования.ПустаяСсылка)) И 
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования.АвтоматическиЗаполнятьНовымТоваром = ИСТИНА
	|";
	
	ГруппыТоваров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГруппаТоваров");
	
	ДобавитьТоварыВОборудование(ГруппыТоваров, Номенклатура);
	
КонецФункции

Функция АвтоматическиЗаполнитьГруппыОборудованияБезФильтра(СкладКомпании, Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования КАК ГруппаТоваров
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ПометкаУдаления = ЛОЖЬ И 
	|	ПодключаемоеОборудование.ОсновнойОтдел = (&СкладКомпании) И 
	|	(НЕ ПодключаемоеОборудование.ГруппаТоваровОборудования = ЗНАЧЕНИЕ(Справочник.ГруппыТоваровОборудования.ПустаяСсылка))
	|";
	
	ГруппыТоваров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГруппаТоваров");
	
	ДобавитьТоварыВОборудование(ГруппыТоваров, Номенклатура);
	
КонецФункции

Функция ДобавитьТоварыВОборудование(ГруппыТоваров, Номенклатура) Экспорт
	
	Если ТипЗнч(ГруппыТоваров) = Тип("Массив") Тогда
		ОтборГруппыТоваров = ГруппыТоваров;
	Иначе
		ОтборГруппыТоваров = Новый Массив;
		ОтборГруппыТоваров.Добавить(ГруппыТоваров);
	КонецЕсли;
	
	Если ТипЗнч(Номенклатура) = Тип("Массив") Тогда
		ОтборНоменклатура = Номенклатура;
	Иначе
		ОтборНоменклатура = Новый Массив;
		ОтборНоменклатура.Добавить(Номенклатура);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппыТоваров", ОтборГруппыТоваров);
	Запрос.УстановитьПараметр("Номенклатура",  ОтборНоменклатура);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ГруппыТоваровОборудования.Ссылка КАК ГруппаТоваров,
	|	ГруппыТоваровОборудования.ЕстьОграниченияПоГруппам КАК ЕстьОграниченияПоГруппам,
	|	ГруппыТоваровОборудования.РежимЗаполнения КАК РежимЗаполнения
	|ПОМЕСТИТЬ
	|	ГруппыТоваровОборудования
	|ИЗ
	|	Справочник.ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ГДЕ
	|	ГруппыТоваровОборудования.Ссылка В (&ГруппыТоваров)
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Ссылка КАК Номенклатура,
	|	ТаблицаНоменклатуры.ТипНоменклатуры,
	|	ТаблицаНоменклатуры.Родитель,
	|	ТаблицаНоменклатуры.ТипНоменклатуры.Весовой КАК Весовой
	|ПОМЕСТИТЬ
	|	ТаблицаНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаНоменклатуры
	|ГДЕ
	|	ТаблицаНоменклатуры.ПометкаУдаления = ЛОЖЬ И 
	|	ТаблицаНоменклатуры.Ссылка В (&Номенклатура) И 
	|	(НЕ ТаблицаНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Услуга)) И 
	|	ТаблицаНоменклатуры.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.Весовой КАК Весовой,
	|	ТаблицаНоменклатуры.Родитель
	|ПОМЕСТИТЬ
	|	ТаблицаИерархии
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.Весовой КАК Весовой,
	|	СтруктураИерархииНоменклатуры.Группа
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтруктураИерархииНоменклатуры КАК СтруктураИерархииНоменклатуры
	|ПО
	|	ТаблицаНоменклатуры.Родитель = СтруктураИерархииНоменклатуры.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ГруппыТоваровОборудования.ГруппаТоваров КАК ГруппаТоваров,
	|	ТаблицаНоменклатуры.Номенклатура
	|ПОМЕСТИТЬ
	|	ГруппыНоменклатуры
	|ИЗ
	|	ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|ПО
	|	ИСТИНА
	|ГДЕ
	|	ГруппыТоваровОборудования.ЕстьОграниченияПоГруппам = ЛОЖЬ И 
	|	ГруппыТоваровОборудования.РежимЗаполнения = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыТоваровОборудования.ГруппаТоваров КАК ГруппаТоваров,
	|	ТаблицаНоменклатуры.Номенклатура
	|ИЗ
	|	ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ГруппыТоваровОборудования.ОграниченияЗаполненияГруппы КАК ОграниченияЗаполненияГруппы
	|ПО
	|	ГруппыТоваровОборудования.ГруппаТоваров = ОграниченияЗаполненияГруппы.Ссылка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаИерархии КАК ТаблицаНоменклатуры
	|ПО
	|	ОграниченияЗаполненияГруппы.ТипГруппаНоменклатуры = ТаблицаНоменклатуры.Родитель
	|ГДЕ
	|	ГруппыТоваровОборудования.ЕстьОграниченияПоГруппам = ИСТИНА И 
	|	ГруппыТоваровОборудования.РежимЗаполнения = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыТоваровОборудования.ГруппаТоваров КАК ГруппаТоваров,
	|	ТаблицаНоменклатуры.Номенклатура
	|ИЗ
	|	ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|ПО
	|	ТаблицаНоменклатуры.Весовой = ИСТИНА
	|ГДЕ
	|	ТаблицаНоменклатуры.Весовой = ИСТИНА И 
	|	ГруппыТоваровОборудования.ЕстьОграниченияПоГруппам = ЛОЖЬ И 
	|	ГруппыТоваровОборудования.РежимЗаполнения = 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыТоваровОборудования.ГруппаТоваров КАК ГруппаТоваров,
	|	ТаблицаНоменклатуры.Номенклатура
	|ИЗ
	|	ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ГруппыТоваровОборудования.ОграниченияЗаполненияГруппы КАК ОграниченияЗаполненияГруппы
	|ПО
	|	ГруппыТоваровОборудования.ГруппаТоваров = ОграниченияЗаполненияГруппы.Ссылка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаИерархии КАК ТаблицаНоменклатуры
	|ПО
	|	ТаблицаНоменклатуры.Весовой = ИСТИНА И 
	|	ОграниченияЗаполненияГруппы.ТипГруппаНоменклатуры = ТаблицаНоменклатуры.Родитель
	|ГДЕ
	|	ТаблицаНоменклатуры.Весовой = ИСТИНА И 
	|	ГруппыТоваровОборудования.ЕстьОграниченияПоГруппам = ИСТИНА И 
	|	ГруппыТоваровОборудования.РежимЗаполнения = 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыТоваровОборудования.ГруппаТоваров КАК ГруппаТоваров,
	|	ТаблицаНоменклатуры.Номенклатура
	|ИЗ
	|	ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|ПО
	|	ТаблицаНоменклатуры.Весовой = ЛОЖЬ
	|ГДЕ
	|	ТаблицаНоменклатуры.Весовой = ЛОЖЬ И 
	|	ГруппыТоваровОборудования.ЕстьОграниченияПоГруппам = ЛОЖЬ И 
	|	ГруппыТоваровОборудования.РежимЗаполнения = 2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыТоваровОборудования.ГруппаТоваров КАК ГруппаТоваров,
	|	ТаблицаНоменклатуры.Номенклатура
	|ИЗ
	|	ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ГруппыТоваровОборудования.ОграниченияЗаполненияГруппы КАК ОграниченияЗаполненияГруппы
	|ПО
	|	ГруппыТоваровОборудования.ГруппаТоваров = ОграниченияЗаполненияГруппы.Ссылка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаИерархии КАК ТаблицаНоменклатуры
	|ПО
	|	ТаблицаНоменклатуры.Весовой = ЛОЖЬ И 
	|	ОграниченияЗаполненияГруппы.ТипГруппаНоменклатуры = ТаблицаНоменклатуры.Родитель
	|ГДЕ
	|	ТаблицаНоменклатуры.Весовой = ЛОЖЬ И 
	|	ГруппыТоваровОборудования.ЕстьОграниченияПоГруппам = ИСТИНА И 
	|	ГруппыТоваровОборудования.РежимЗаполнения = 2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыТоваровОборудования.ГруппаТоваров КАК ГруппаТоваров,
	|	ТаблицаНоменклатуры.Номенклатура
	|ИЗ
	|	ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ГруппыТоваровОборудования.ОграниченияЗаполненияГруппы КАК ОграниченияЗаполненияГруппы
	|ПО
	|	ГруппыТоваровОборудования.ГруппаТоваров = ОграниченияЗаполненияГруппы.Ссылка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|ПО
	|	ОграниченияЗаполненияГруппы.ТипГруппаНоменклатуры = ТаблицаНоменклатуры.ТипНоменклатуры
	|ГДЕ
	|	ГруппыТоваровОборудования.РежимЗаполнения = 3
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаНоменклатуры
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаИерархии
	|;
	|
	|УНИЧТОЖИТЬ
	|	ГруппыТоваровОборудования
	|;
	|
	|ВЫБРАТЬ
	|	ГруппыНоменклатуры.ГруппаТоваров КАК ГруппаТоваров,
	|	ГруппыНоменклатуры.ГруппаТоваров.ЗаполнятьПропуски КАК ЗаполнятьПропуски,
	|	ГруппыНоменклатуры.Номенклатура
	|ИЗ
	|	ГруппыНоменклатуры КАК ГруппыНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ПО
	|	ГруппыНоменклатуры.ГруппаТоваров = ТоварыВОборудовании.ГруппаТоваров И 
	|	ГруппыНоменклатуры.Номенклатура = ТоварыВОборудовании.Номенклатура И 
	|	ТоварыВОборудовании.ШтрихКод = """"
	|ГДЕ
	|	ТоварыВОборудовании.Номенклатура ЕСТЬ NULL
	|ИТОГИ ПО
	|	ГруппаТоваров
	|";
	
	ВыборкаГруппа = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруппа.Следующий() Цикл
		
		ГруппаТоваров = ВыборкаГруппа.ГруппаТоваров;
		
		// Наложим блокировку на считываемые данные
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрСведений", "ТоварыВОборудовании");
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("ГруппаТоваров", ГруппаТоваров);
		
		НачатьТранзакцию();
		
		Отказ = Ложь;
		ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки,,Отказ);
		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		
		НомерЯчейки = 0;
		КоличествоСвободныхЯчеек = 0;
		
		ЗаполнятьПропуски = ВыборкаГруппа.ЗаполнятьПропуски;
		Если ЗаполнятьПропуски Тогда
			СвободныеНомераЯчеек = ПолучитьСвободныеНомераЯчеек(ГруппаТоваров);
			КоличествоСвободныхЯчеек = СвободныеНомераЯчеек.Количество();
		Иначе
			НомерЯчейки = РегистрыСведений.ТоварыВОборудовании.ПолучитьМаксимальныйНомерЯчейки(ГруппаТоваров);
		КонецЕсли;
		
		Выборка = ВыборкаГруппа.Выбрать();
		ПередачаПослеПечати = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.ПередачаВОборудованиеПослеПечати, Справочники.ГруппыТоваровОборудования.ПолучитьПодразделениеКомпанииПоГруппеТоваров(ГруппаТоваров));
		Пока Выборка.Следующий() Цикл
			Если КоличествоСвободныхЯчеек>0 Тогда
				ТекущийИндекс = КоличествоСвободныхЯчеек-1;
				НомерЯчейки = СвободныеНомераЯчеек[ТекущийИндекс];
				СвободныеНомераЯчеек.Удалить(ТекущийИндекс);
			Иначе
				НомерЯчейки = НомерЯчейки+1;
			КонецЕсли;
			  
			НоваяЗапись = РегистрыСведений.ТоварыВОборудовании.СоздатьМенеджерЗаписи(); 
			НоваяЗапись.ГруппаТоваров   = ГруппаТоваров;
			НоваяЗапись.Номенклатура    = Выборка.Номенклатура;
			НоваяЗапись.НомерЯчейки     = НомерЯчейки;
			НоваяЗапись.МоментИзменения = ТекущаяДатаСеанса();
			НоваяЗапись.ВыполненаПечатьЦенников = ?(ПередачаПослеПечати = Неопределено, Истина, НЕ ПередачаПослеПечати);
			Попытка
				НоваяЗапись.Записать();
			Исключение
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецПопытки;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	КонецЦикла;
	
	Возврат Истина
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
